OpenFOAM-v1812/tutorials/verificationAndValidation/atmosphericModels/atmForestStability/setups.orig/common/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.077821;

boundaryField
{
    bottom
    {
        type            atmOmegaWallFunction;
        kappa           0.40;
        Cmu             0.03;
        z0              uniform 0.028;
        value           uniform 0.028;
    }

    top
    {
        type            slip;
    }

    "(inlet|outlet|left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
